#include <stdio.h>

int main()
{
	int N;
	scanf("%d", &N);
	int n=N; //由于每轮判断需要对N进行递减，在此我们保留原始N值，做循环以及输出用
	int a[N];
	int i;
   /*读入猴子序号*/
	for (i=0; i<N; i++)
	{
		a[i]=i+1;
	}
   /*进行N-3轮淘汰*/
	int j;
	for (j=1; j<=n-3;j++)
	{
		for (i=0; i<n; i++)
		{
			if (a[i] == 3) //每轮淘汰以序号是否=3作为判断条件
			{
				int t=0;
		    /*按更新规律对序号进行更新*/
				for (t=0; t<n; t++)					
				{
					if (a[t]<a[i])
					{
						a[t] = a[t] + N-a[i]; 
					}
					else if (a[t]>a[i])
					{
						a[t] = a[t] - a[i];
					}
				}
/*每一轮更新完成后，将淘汰猴序号设为如下，N递减，跳出内层循环，进行下一轮淘汰*/
				a[i] = -1000000;
				N--;
				break;
			}
		}	
	}
/*N=1特殊情况，单独输出*/	
	if ( n==1 )
	{
		printf("%d\n", n);
	}
/*N=2和3时，原本也应单独输出，但考虑到与以下循环结果一致，因此不单独给出*/
/*N-3（N>3）轮淘汰后，剩下的3只猴子中，序号2为猴王*/
	for (i=0; i<n; i++)
	{
		if (a[i] == 2)
		{
			printf("%d\n", i+1);//猴子序号等于数组下标+1
		}
	}
	return 0;
}
